[Killed] PublicVisibility
Http/Controllers/Auth/AuthController.php:9:5
 
 class AuthController extends Controller
 {
-    public function login()
+    protected function login()
     {
         $credentials = request(['email', 'password']);
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] ArrayItemRemoval
Http/Controllers/Auth/AuthController.php:11:9
 {
     public function login()
     {
-        $credentials = request(['email', 'password']);
+        $credentials = request(['password']);
 
         if (! $token = auth('api')->attempt($credentials)) {
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] LogicalNot
Http/Controllers/Auth/AuthController.php:13:9
     {
         $credentials = request(['email', 'password']);
 
-        if (! $token = auth('api')->attempt($credentials)) {
+        if ($token = auth('api')->attempt($credentials)) {
             return response()->json(['error' => 'Unauthorized'], 401);
         }
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] DecrementInteger
Http/Controllers/Auth/AuthController.php:14:13
         $credentials = request(['email', 'password']);
 
         if (! $token = auth('api')->attempt($credentials)) {
-            return response()->json(['error' => 'Unauthorized'], 401);
+            return response()->json(['error' => 'Unauthorized'], 400);
         }
 
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] IncrementInteger
Http/Controllers/Auth/AuthController.php:14:13
         $credentials = request(['email', 'password']);
 
         if (! $token = auth('api')->attempt($credentials)) {
-            return response()->json(['error' => 'Unauthorized'], 401);
+            return response()->json(['error' => 'Unauthorized'], 402);
         }
 
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] ProtectedVisibility
Http/Controllers/Auth/AuthController.php:20:5
         return $this->respondWithToken($token);
     }
 
-    protected function respondWithToken($token)
+    private function respondWithToken($token)
     {
         return response()->json([
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] Multiplication
Http/Controllers/Auth/AuthController.php:25:13
         return response()->json([
             'access_token' => $token,
             'token_type' => 'bearer',
-            'expires_in' => auth('api')->factory()->getTTL() * 60,
+            return response()->json(['access_token' => $token, 'token_type' => 'bearer', 'expires_in' => auth('api')->factory()->getTTL() / 60]);
         ]);
     }
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] DecrementInteger
Http/Controllers/Auth/AuthController.php:25:13
         return response()->json([
             'access_token' => $token,
             'token_type' => 'bearer',
-            'expires_in' => auth('api')->factory()->getTTL() * 60,
+            return response()->json(['access_token' => $token, 'token_type' => 'bearer', 'expires_in' => auth('api')->factory()->getTTL() * 59]);
         ]);
     }
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.
