[Killed] PublicVisibility
Http/Controllers/CaminhaoController.php:18:5
     ) {
     }
 
-    public function index(PaginacaoRequest $request)
+    protected function index(PaginacaoRequest $request)
     {
         try {
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] NewObject
Http/Controllers/CaminhaoController.php:21:13
     public function index(PaginacaoRequest $request)
     {
         try {
-            return new JsonResponse(
-                $this->caminhao->obterTodos($request->query('offset')),
-                JsonResponse::HTTP_OK);
+            new JsonResponse($this->caminhao->obterTodos($request->query('offset')), JsonResponse::HTTP_OK);
+            return null;K);
         } catch (\Exception $e) {
             return new JsonResponse(
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] PublicVisibility
Http/Controllers/CaminhaoController.php:32:5
         }
     }
 
-    public function show(string $id)
+    protected function show(string $id)
     {
         try {
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] NewObject
Http/Controllers/CaminhaoController.php:40:13
                 JsonResponse::HTTP_OK);
         } catch (\Exception $e) {
 
-            return new JsonResponse(
-                $e->getMessage(),
-                JsonResponse::HTTP_BAD_REQUEST
-            );
+            new JsonResponse($e->getMessage(), JsonResponse::HTTP_BAD_REQUEST);
+            return null;
         }
     }
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] PublicVisibility
Http/Controllers/CaminhaoController.php:47:5
         }
     }
 
-    public function store(CriarCaminhaoRequest $request)
+    protected function store(CriarCaminhaoRequest $request)
     {
         try {
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] MethodCallRemoval
Http/Controllers/CaminhaoController.php:50:13
     public function store(CriarCaminhaoRequest $request)
     {
         try {
-            $this->caminhao->criar($request->all());
+            
 
             return new JsonResponse(
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] PublicVisibility
Http/Controllers/CaminhaoController.php:64:5
         }
     }
 
-    public function update(AtualizarCaminhaoRequest $request, string $id)
+    protected function update(AtualizarCaminhaoRequest $request, string $id)
     {
         try {
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] MethodCallRemoval
Http/Controllers/CaminhaoController.php:67:13
     public function update(AtualizarCaminhaoRequest $request, string $id)
     {
         try {
-            $this->caminhao->atualizar($id, $request->all());
+            
 
             return new JsonResponse(null, JsonResponse::HTTP_NO_CONTENT);
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] PublicVisibility
Http/Controllers/CaminhaoController.php:79:5
         }
     }
 
-    public function destroy(string $id)
+    protected function destroy(string $id)
     {
         try {
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] MethodCallRemoval
Http/Controllers/CaminhaoController.php:82:13
     public function destroy(string $id)
     {
         try {
-            $this->caminhao->deletar($id);
+            
 
             return new JsonResponse(null, JsonResponse::HTTP_NO_CONTENT);
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] NewObject
Http/Controllers/CaminhaoController.php:84:13
         try {
             $this->caminhao->deletar($id);
 
-            return new JsonResponse(null, JsonResponse::HTTP_NO_CONTENT);
+            new JsonResponse(null, JsonResponse::HTTP_NO_CONTENT);
+            return null;
         } catch (\Exception $e) {
             return new JsonResponse(
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.
