[NoCoverage] PublicVisibility
Http/Controllers/Auth/AuthenticatedSessionController.php:17:5
     /**
      * Handle an incoming authentication request.
      */
-    public function store(LoginRequest $request): Response
+    protected function store(LoginRequest $request) : Response
     {
         $request->authenticate();

[NoCoverage] MethodCallRemoval
Http/Controllers/Auth/AuthenticatedSessionController.php:19:9
      */
     public function store(LoginRequest $request): Response
     {
-        $request->authenticate();
+        
 
         $request->session()->regenerate();

[NoCoverage] MethodCallRemoval
Http/Controllers/Auth/AuthenticatedSessionController.php:21:9
     {
         $request->authenticate();
 
-        $request->session()->regenerate();
+        
 
         return response()->noContent();

[NoCoverage] PublicVisibility
Http/Controllers/Auth/AuthenticatedSessionController.php:29:5
     /**
      * Destroy an authenticated session.
      */
-    public function destroy(Request $request): Response
+    protected function destroy(Request $request) : Response
     {
         Auth::guard('web')->logout();

[NoCoverage] MethodCallRemoval
Http/Controllers/Auth/AuthenticatedSessionController.php:33:9
     {
         Auth::guard('web')->logout();
 
-        $request->session()->invalidate();
+        
 
         $request->session()->regenerateToken();

[NoCoverage] MethodCallRemoval
Http/Controllers/Auth/AuthenticatedSessionController.php:35:9
 
         $request->session()->invalidate();
 
-        $request->session()->regenerateToken();
+        
 
         return response()->noContent();
