[Killed] PublicVisibility
Http/Controllers/ModeloController.php:18:5
     ) {
     }
 
-    public function index(PaginacaoRequest $request): JsonResponse
+    protected function index(PaginacaoRequest $request) : JsonResponse
     {
         try {
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] PublicVisibility
Http/Controllers/ModeloController.php:32:5
         }
     }
 
-    public function show(string $id): JsonResponse
+    protected function show(string $id) : JsonResponse
     {
         try {
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] PublicVisibility
Http/Controllers/ModeloController.php:47:5
         }
     }
 
-    public function store(CriarModeloRequest $request): JsonResponse
+    protected function store(CriarModeloRequest $request) : JsonResponse
     {
         try {
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] MethodCallRemoval
Http/Controllers/ModeloController.php:50:13
     public function store(CriarModeloRequest $request): JsonResponse
     {
         try {
-            $this->modelo->criar($request->all());
+            
 
             return new JsonResponse(
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] PublicVisibility
Http/Controllers/ModeloController.php:65:5
         }
     }
 
-    public function update(AtualizarModeloRequest $request, string $id): JsonResponse
+    protected function update(AtualizarModeloRequest $request, string $id) : JsonResponse
     {
         try {
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] MethodCallRemoval
Http/Controllers/ModeloController.php:68:13
     public function update(AtualizarModeloRequest $request, string $id): JsonResponse
     {
         try {
-            $this->modelo->atualizar($id, $request->all());
+            
 
             return new JsonResponse(null, JsonResponse::HTTP_NO_CONTENT);
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] PublicVisibility
Http/Controllers/ModeloController.php:80:5
         }
     }
 
-    public function destroy(string $id): JsonResponse
+    protected function destroy(string $id) : JsonResponse
     {
         try {
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] MethodCallRemoval
Http/Controllers/ModeloController.php:83:13
     public function destroy(string $id): JsonResponse
     {
         try {
-            $this->modelo->deletar($id);
+            
 
             return new JsonResponse(null, JsonResponse::HTTP_NO_CONTENT);
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.
