[Killed] PublicVisibility
Http/Controllers/MotoristaController.php:49:5
         }
     }
 
-    public function store(CriarMotoristaRequest $request): JsonResponse
+    protected function store(CriarMotoristaRequest $request) : JsonResponse
     {
         try {
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] MethodCallRemoval
Http/Controllers/MotoristaController.php:52:13
     public function store(CriarMotoristaRequest $request): JsonResponse
     {
         try {
-            $this->motorista->criar($request->all());
+            
 
             return new JsonResponse(
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] PublicVisibility
Http/Controllers/MotoristaController.php:67:5
         }
     }
 
-    public function update(AtualizarMotoristaRequest $request, string $id): JsonResponse
+    protected function update(AtualizarMotoristaRequest $request, string $id) : JsonResponse
     {
         try {
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] MethodCallRemoval
Http/Controllers/MotoristaController.php:70:13
     public function update(AtualizarMotoristaRequest $request, string $id): JsonResponse
     {
         try {
-            $this->motorista->atualizar($id, $request->all());
+            
 
             return new JsonResponse(null, JsonResponse::HTTP_NO_CONTENT);
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] MethodCallRemoval
Http/Controllers/MotoristaController.php:85:13
     public function destroy(string $id): JsonResponse
     {
         try {
-            $this->motorista->deletar($id);
+            
 
             return new JsonResponse(null, JsonResponse::HTTP_NO_CONTENT);
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.
