[NoCoverage] PublicVisibility
Http/Controllers/Auth/EmailVerificationNotificationController.php:16:5
     /**
      * Send a new email verification notification.
      */
-    public function store(Request $request): JsonResponse|RedirectResponse
+    protected function store(Request $request) : JsonResponse|RedirectResponse
     {
         if ($request->user()->hasVerifiedEmail()) {

[NoCoverage] IfNegation
Http/Controllers/Auth/EmailVerificationNotificationController.php:18:9
      */
     public function store(Request $request): JsonResponse|RedirectResponse
     {
-        if ($request->user()->hasVerifiedEmail()) {
-            return redirect()->intended(RouteServiceProvider::HOME);
-        }
+        if (!$request->user()->hasVerifiedEmail()) {
 
         $request->user()->sendEmailVerificationNotification();

[NoCoverage] MethodCallRemoval
Http/Controllers/Auth/EmailVerificationNotificationController.php:22:9
             return redirect()->intended(RouteServiceProvider::HOME);
         }
 
-        $request->user()->sendEmailVerificationNotification();
+        
 
         return response()->json(['status' => 'verification-link-sent']);
