[NoCoverage] PublicVisibility
Http/Controllers/Auth/NewPasswordController.php:22:5
      *
      * @throws \Illuminate\Validation\ValidationException
      */
-    public function store(Request $request): JsonResponse
+    protected function store(Request $request) : JsonResponse
     {
         $request->validate([

[NoCoverage] MethodCallRemoval
Http/Controllers/Auth/NewPasswordController.php:24:9
      */
     public function store(Request $request): JsonResponse
     {
-        $request->validate([
-            'token' => ['required'],
-            'email' => ['required', 'email'],
-            'password' => ['required', 'confirmed', Rules\Password::defaults()],
-        ]);
+        
 
         // Here we will attempt to reset the user's password. If it is successful we

[NoCoverage] ArrayItemRemoval
Http/Controllers/Auth/NewPasswordController.php:25:13
     public function store(Request $request): JsonResponse
     {
         $request->validate([
-            'token' => ['required'],
+            $request->validate(['token' => [], 'email' => ['required', 'email'], 'password' => ['required', 'confirmed', Rules\Password::defaults()]]);
             'email' => ['required', 'email'],
             'password' => ['required', 'confirmed', Rules\Password::defaults()],

[NoCoverage] MethodCallRemoval
Http/Controllers/Auth/NewPasswordController.php:36:17
         $status = Password::reset(
             $request->only('email', 'password', 'password_confirmation', 'token'),
             function ($user) use ($request) {
-                $user->forceFill([
-                    'password' => Hash::make($request->password),
-                    'remember_token' => Str::random(60),
-                ])->save();
+                
 
                 event(new PasswordReset($user));

[NoCoverage] DecrementInteger
Http/Controllers/Auth/NewPasswordController.php:38:21
             function ($user) use ($request) {
                 $user->forceFill([
                     'password' => Hash::make($request->password),
-                    'remember_token' => Str::random(60),
+                    $user->forceFill(['password' => Hash::make($request->password), 'remember_token' => Str::random(59)])->save();
                 ])->save();
 

[NoCoverage] IncrementInteger
Http/Controllers/Auth/NewPasswordController.php:38:21
             function ($user) use ($request) {
                 $user->forceFill([
                     'password' => Hash::make($request->password),
-                    'remember_token' => Str::random(60),
+                    $user->forceFill(['password' => Hash::make($request->password), 'remember_token' => Str::random(61)])->save();
                 ])->save();
 

[NoCoverage] FunctionCallRemoval
Http/Controllers/Auth/NewPasswordController.php:41:17
                     'remember_token' => Str::random(60),
                 ])->save();
 
-                event(new PasswordReset($user));
+                
             }
         );

[NoCoverage] NotEqual
Http/Controllers/Auth/NewPasswordController.php:45:9
             }
         );
 
-        if ($status != Password::PASSWORD_RESET) {
+        if ($status == Password::PASSWORD_RESET) {
             throw ValidationException::withMessages([
                 'email' => [__($status)],

[NoCoverage] Throw_
Http/Controllers/Auth/NewPasswordController.php:46:13
         );
 
         if ($status != Password::PASSWORD_RESET) {
-            throw ValidationException::withMessages([
-                'email' => [__($status)],
-            ]);
+            ValidationException::withMessages(['email' => [__($status)]]);
         }
 

[NoCoverage] ArrayItem
Http/Controllers/Auth/NewPasswordController.php:51:9
             ]);
         }
 
-        return response()->json(['status' => __($status)]);
+        return response()->json(['status' > __($status)]);
     }
 }
