[Killed] PublicVisibility
Http/Controllers/TransportadoraController.php:49:5
         }
     }
 
-    public function store(CriarTransportadoraRequest $request): JsonResponse
+    protected function store(CriarTransportadoraRequest $request) : JsonResponse
     {
         try {
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] MethodCallRemoval
Http/Controllers/TransportadoraController.php:52:13
     public function store(CriarTransportadoraRequest $request): JsonResponse
     {
         try {
-            $this->transportadora->criar($request->all());
+            
 
             return new JsonResponse(
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] PublicVisibility
Http/Controllers/TransportadoraController.php:66:5
         }
     }
 
-    public function update(AtualizarTransportadoraRequest $request, string $id): JsonResponse
+    protected function update(AtualizarTransportadoraRequest $request, string $id) : JsonResponse
     {
         try {
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] MethodCallRemoval
Http/Controllers/TransportadoraController.php:69:13
     public function update(AtualizarTransportadoraRequest $request, string $id): JsonResponse
     {
         try {
-            $this->transportadora->atualizar($id, $request->all());
+            
 
             return new JsonResponse(null, Response::HTTP_NO_CONTENT);
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] MethodCallRemoval
Http/Controllers/TransportadoraController.php:83:13
     public function destroy(string $id): JsonResponse
     {
         try {
-            $this->transportadora->deletar($id);
+            
 
             return new JsonResponse(null, Response::HTTP_NO_CONTENT);
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.
