[NoCoverage] MethodCallRemoval
Http/Controllers/Auth/PasswordResetLinkController.php:20:9
      */
     public function store(Request $request): JsonResponse
     {
-        $request->validate([
-            'email' => ['required', 'email'],
-        ]);
+        
 
         // We will send the password reset link to this user. Once we have attempted

[NoCoverage] NotEqual
Http/Controllers/Auth/PasswordResetLinkController.php:31:9
             $request->only('email')
         );
 
-        if ($status != Password::RESET_LINK_SENT) {
+        if ($status == Password::RESET_LINK_SENT) {
             throw ValidationException::withMessages([
                 'email' => [__($status)],

[NoCoverage] Throw_
Http/Controllers/Auth/PasswordResetLinkController.php:32:13
         );
 
         if ($status != Password::RESET_LINK_SENT) {
-            throw ValidationException::withMessages([
-                'email' => [__($status)],
-            ]);
+            ValidationException::withMessages(['email' => [__($status)]]);
         }
 
