[Killed] Ternary
Services/CaminhaoService.php:18:9
 
     public function obterTodos(int $offset = null): LengthAwarePaginator
     {
-        $offset = $offset ?: Caminhao::count();
+        $offset = $offset ? Caminhao::count() : $offset;
 
         return $this->caminhao::select(
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] MethodCallRemoval
Services/CaminhaoService.php:43:9
 
     public function criar(array $request): void
     {
-        $this->caminhao::create($request);
+        
     }
 
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] MethodCallRemoval
Services/CaminhaoService.php:48:9
 
     public function atualizar(string $id, array $request): void
     {
-        $this->caminhao::where('id', $id)->update($request);
+        
     }
 
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] MethodCallRemoval
Services/CaminhaoService.php:53:9
 
     public function deletar(string $id): void
     {
-        $this->caminhao::destroy(explode(',', $id));
+        
     }
 }
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.
