[NoCoverage] PublicVisibility
Http/Controllers/Auth/RegisteredUserController.php:21:5
      *
      * @throws \Illuminate\Validation\ValidationException
      */
-    public function store(Request $request): Response
+    protected function store(Request $request) : Response
     {
         $request->validate([

[NoCoverage] MethodCallRemoval
Http/Controllers/Auth/RegisteredUserController.php:23:9
      */
     public function store(Request $request): Response
     {
-        $request->validate([
-            'name' => ['required', 'string', 'max:255'],
-            'email' => ['required', 'string', 'email', 'max:255', 'unique:'.User::class],
-            'password' => ['required', 'confirmed', Rules\Password::defaults()],
-        ]);
+        
 
         $user = User::create([

[NoCoverage] ArrayItemRemoval
Http/Controllers/Auth/RegisteredUserController.php:23:9
      */
     public function store(Request $request): Response
     {
-        $request->validate([
-            'name' => ['required', 'string', 'max:255'],
-            'email' => ['required', 'string', 'email', 'max:255', 'unique:'.User::class],
-            'password' => ['required', 'confirmed', Rules\Password::defaults()],
-        ]);
+        $request->validate(['email' => ['required', 'string', 'email', 'max:255', 'unique:' . User::class], 'password' => ['required', 'confirmed', Rules\Password::defaults()]]);
 
         $user = User::create([

[NoCoverage] ArrayItem
Http/Controllers/Auth/RegisteredUserController.php:30:13
         ]);
 
         $user = User::create([
-            'name' => $request->name,
+            $user = User::create(['name' > $request->name, 'email' => $request->email, 'password' => Hash::make($request->password)]);
             'email' => $request->email,
             'password' => Hash::make($request->password),

[NoCoverage] FunctionCallRemoval
Http/Controllers/Auth/RegisteredUserController.php:35:9
             'password' => Hash::make($request->password),
         ]);
 
-        event(new Registered($user));
+        
 
         Auth::login($user);

[NoCoverage] MethodCallRemoval
Http/Controllers/Auth/RegisteredUserController.php:37:9
 
         event(new Registered($user));
 
-        Auth::login($user);
+        
 
         return response()->noContent();
