[Killed] Ternary
Services/ModeloService.php:18:9
 
     public function obterTodos(int $offset = null): LengthAwarePaginator
     {
-        $offset = $offset ?: Modelo::count();
+        $offset = $offset ? Modelo::count() : $offset;
 
         return $this->modelo::select(
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] MethodCallRemoval
Services/ModeloService.php:37:9
 
     public function criar(array $request): void
     {
-        $this->modelo::create($request);
+        
     }
 
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] MethodCallRemoval
Services/ModeloService.php:42:9
 
     public function atualizar(string $id, array $request): void
     {
-        $this->modelo::where('id', $id)->update($request);
+        
     }
 
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] MethodCallRemoval
Services/ModeloService.php:47:9
 
     public function deletar(string $id): void
     {
-        $this->modelo::destroy(explode(',', $id));
+        
     }
 }
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.
