[Killed] Ternary
Services/MotoristaService.php:19:9
 
     public function obterTodos(int $offset = null): LengthAwarePaginator
     {
-        $offset = $offset ?: Motorista::count();
+        $offset = $offset ? Motorista::count() : $offset;
 
         return $this->motorista::with('caminhoes:id,motorista_id,placa')
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] MethodCallRemoval
Services/MotoristaService.php:44:9
     public function criar(array $request): void
     {
         $request['data_nascimento'] = Carbon::createFromDate($request['data_nascimento']);
-        $this->motorista::create($request);
+        
     }
 
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] MethodCallRemoval
Services/MotoristaService.php:50:9
     public function atualizar(string $id, array $request): void
     {
         $request['data_nascimento'] = Carbon::createFromDate($request['data_nascimento']);
-        $this->motorista::where('id', $id)->update($request);
+        
     }
 
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] MethodCallRemoval
Services/MotoristaService.php:55:9
 
     public function deletar(string $id): void
     {
-        $this->motorista::destroy(explode(',', $id));
+        
     }
 }
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.
