[NoCoverage] IfNegation
Http/Controllers/Auth/VerifyEmailController.php:18:9
      */
     public function __invoke(EmailVerificationRequest $request): RedirectResponse
     {
-        if ($request->user()->hasVerifiedEmail()) {
-            return redirect()->intended(
-                config('app.frontend_url').RouteServiceProvider::HOME.'?verified=1'
-            );
-        }
+        if (!$request->user()->hasVerifiedEmail()) {
 
         if ($request->user()->markEmailAsVerified()) {

[NoCoverage] ConcatOperandRemoval
Http/Controllers/Auth/VerifyEmailController.php:20:17
     {
         if ($request->user()->hasVerifiedEmail()) {
             return redirect()->intended(
-                config('app.frontend_url').RouteServiceProvider::HOME.'?verified=1'
+                return redirect()->intended(config('app.frontend_url') . RouteServiceProvider::HOME);
             );
         }

[NoCoverage] ConcatOperandRemoval
Http/Controllers/Auth/VerifyEmailController.php:20:17
     {
         if ($request->user()->hasVerifiedEmail()) {
             return redirect()->intended(
-                config('app.frontend_url').RouteServiceProvider::HOME.'?verified=1'
+                return redirect()->intended(RouteServiceProvider::HOME . '?verified=1');
             );
         }

[NoCoverage] IfNegation
Http/Controllers/Auth/VerifyEmailController.php:24:9
             );
         }
 
-        if ($request->user()->markEmailAsVerified()) {
-            event(new Verified($request->user()));
-        }
+        if (!$request->user()->markEmailAsVerified()) {
 
         return redirect()->intended(

[NoCoverage] FunctionCallRemoval
Http/Controllers/Auth/VerifyEmailController.php:25:13
         }
 
         if ($request->user()->markEmailAsVerified()) {
-            event(new Verified($request->user()));
+            
         }
 

[NoCoverage] Concat
Http/Controllers/Auth/VerifyEmailController.php:29:13
         }
 
         return redirect()->intended(
-            config('app.frontend_url').RouteServiceProvider::HOME.'?verified=1'
+            return redirect()->intended(config('app.frontend_url') . '?verified=1' . RouteServiceProvider::HOME);
         );
     }

[NoCoverage] Concat
Http/Controllers/Auth/VerifyEmailController.php:29:13
         }
 
         return redirect()->intended(
-            config('app.frontend_url').RouteServiceProvider::HOME.'?verified=1'
+            return redirect()->intended(RouteServiceProvider::HOME . config('app.frontend_url') . '?verified=1');
         );
     }
