[Killed] Ternary
Services/TransportadoraService.php:18:9
 
     public function obterTodos(int $offset = null): LengthAwarePaginator
     {
-        $offset = $offset ?: Transportadora::count();
+        $offset = $offset ? Transportadora::count() : $offset;
 
         return $this->transportadora::with('motoristas:id,transportadora_id,nome')
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] MethodCallRemoval
Services/TransportadoraService.php:42:9
 
     public function criar(array $request): void
     {
-        $this->transportadora::create($request);
+        
     }
 
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] MethodCallRemoval
Services/TransportadoraService.php:47:9
 
     public function atualizar(string $id, array $request): void
     {
-        $this->transportadora::where('id', $id)->update($request);
+        
     }
 
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.

[Killed] MethodCallRemoval
Services/TransportadoraService.php:52:9
 
     public function deletar(string $id): void
     {
-        $this->transportadora::destroy(explode(',', $id));
+        
     }
 }
statusReason: INFO  Test file "/var/www/app/vendor/pestphp/pest/src/Factories/TestCaseFactory.php(196) : eval()'d code" not found.
